Data Manipulation on modules grading dataset

Before continuing import the pandas libraries.

In [1]:
import pandas as pd

## Manip 1

You have been given the following data which is the result of some initial analysis on a data source:

In [2]:

t_df=pd.DataFrame()

data1_ss=pd.Series([1, 12, 29, 3, 22, 4, 7, 10, 15, 26, 9, 18, 11, 29, 28, 0, 12, 3, 22, 29, 22, 7, 18, 14, 6, 18, 25, 26, 19, 20])
t_df['col1']=data1_ss

data2_ss=pd.Series([6, 8, 4, 1, 1, 7, 1, 2, 7, 0, 5, 3, 0, 2, 7, 4, 9, 9, 8, 1])
t_df['col2']=data2_ss

data3_ss=pd.Series([4, 0, 5, 8, 7, 7, 1, 6, 4, 2, 4, 6, 5, 8, 8, 1, 5, 6, 9, 2, 6, 7, 4, 7, 8])
t_df['col3']=data3_ss

t_df.head()

   col1  col2  col3
0     1   6.0   4.0
1    12   8.0   0.0
2    29   4.0   5.0
3     3   1.0   8.0
4    22   1.0   7.0

Task: Which column in <code>t_df</code> contains the greatest total sum of numbers? (Write a short python routine to calculate the answer).

In [3]:
# answer:

sum1=sum(t_df['col1'])
sum2=sum(t_df['col2'])
sum3=sum(t_df['col3'])

if (sum1 > sum2) and (sum1 > sum3):
    print('col1')    
elif (sum2 > sum3):
    print('col2')
else:
    print('col3')

col3

## Manip 2

You have been given the following python list:

In [4]:
testList_ls=[14.2, 12.3, 9.0, 41.1, 5.1, 20.6, 15.6, 1.1, 0.3, 4.7, 20.7, 38.6, 36.3, 38.2, 31.2, 13.9, 14.7, 4.5, 45.9, 36.0, 34.6, 32.4, 16.6, 23.1, 8.4, 14.7, 32.2, 43.1, 17.0, 13.1]

Task: Using Python identify the 5 largest elements of <code>testList_ls</code>

In [5]:
# answer

testList_ls.sort()
testList_ls[len(testList_ls)-5:len(testList_ls)]

[38.2, 38.6, 41.1, 43.1, 45.9]

You have now been given the following dataframe:

In [6]:
testDataframe_df=pd.DataFrame({'col1':['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't'],
                               'col2':[3.6, 19.3, 4.2, 0.9, 10.2, 5.0, 45.3, 21.6, 4.6, 47.2, 40.4, 27.3, 13.9, 49.5, 37.8, 19.8, 36.5, 19.4, 0.3, 16.8]})

testDataframe_df.head()

  col1  col2
0    a   3.6
1    b  19.3
2    c   4.2
3    d   0.9
4    e  10.2

Task: Identify the values of <code>col1</code> which appear with the 5 largest values in <code>col2</code>

In [7]:
# answer

testDataframe_df.sort_values(by=['col2'])
sortedColumn_ls=list(testDataframe_df['col1'])

sortedColumn_ls[len(sortedColumn_ls)-5:len(sortedColumn_ls)]

['p', 'q', 'r', 's', 't']

## Manip 3

Task: Given the following list:

In [8]:
list_ls=[1, 9, 3, 5, 10, 4, 2, 0, 8, 7, 6]

map the members of the list onto a scaled list from 0 to 1.

In [9]:
# answer:
min_value = min(list_ls)
max_value = max(list_ls)
for i in range(len(list_ls)):
    list_ls[i]=(list_ls[i]-min_value)/(max_value-min_value)
    
list_ls

[0.1, 0.9, 0.3, 0.5, 1.0, 0.4, 0.2, 0.0, 0.8, 0.7, 0.6]

## Manip 4

You have been given a data that relates to a number of modules offered by an institution. The following code blocks load the libraries necessary and the data from a csv file for you so that you can perform some further analysis.

In [10]:
from pandasql import sqldf
# then create a simple wrapper function that allows us to supply the query 'q' without the surrounding syntax.
pysqldf = lambda q: sqldf(q, globals())

In [11]:
mixed_module_data_v2 = pd.read_csv('data/mixed_module_data_v2.csv');

The first 5 rows of the supplied data are shown below.

In [12]:
mixed_module_data_v2.head(5)

  ModuleCode  Year Student  Grade
0      ME230  2020      SM     62
1      ME230  2020      PS     44
2      ME230  2020      QS     33
3      ME230  2020      TP     56
4      ME230  2020      SF     69

Task a: Write an SQL query that will display the data associatesd with module codes ME230 and CS410

In [13]:
# answer
query = '''\
SELECT * \
FROM mixed_module_data_v2 \
WHERE ModuleCode = "ME230" OR  ModuleCode = "CS410" \
'''
result = pysqldf(query)
result

   ModuleCode  Year Student  Grade
0       ME230  2020      SM     62
1       ME230  2020      PS     44
2       ME230  2020      QS     33
3       ME230  2020      TP     56
4       ME230  2020      SF     69
5       ME230  2020      RS     69
6       ME230  2021      RS     51
7       ME230  2020      OO     10
8       ME230  2020      PO     23
9       ME230  2020      NT     54
10      ME230  2020      PT     33
11      ME230  2020      TD     55
12      ME230  2020      FP     32
13      ME230  2020      KD     43
14      CS410  2020      TD     27
15      CS410  2020      FP     39
16      CS410  2020      KD     65
17      ME230  2022      SM     71
18      CS410  2021      SF     31
19      CS410  2023      RS     28
20      CS410  2023      NT     78
21      ME230  2023      SM     75
22      ME230  2023      LM     17
23      ME230  2023      TD     32
24      CS410  2021      QS     12

Task b: Write an SQL query to display modules which have an average grade higher than 50

In [14]:
# answer
query = ''' \
SELECT ModuleCode \
FROM mixed_module_data_v2 \
GROUP BY ModuleCode \
HAVING AVG(Grade) > 50 \
'''
result = pysqldf(query)
result

  ModuleCode
0      CS350
1      ME237